//=====================================================
/* Задача 12
Дан массив с числами: `[1,2,3,-5,-2,1,-4]`
Найдите сумму положительных элементов массива. В результате вы должны получить число `7`
*/
//=====================================================
var arr = [1, 2, 3, -5, -2, 1, -4];
var sum = 0;
console.log(arr);
console.log("Список положительных элементов:");
for (var i = 0; i < arr.length; i++) {
  if (arr[i] > 0) {
    console.log(i + 1 + "-й, знач.:" + arr[i]);
    sum = sum + arr[i];
  }
}
console.log("sum_arr:" + sum); //sum_arr:7
//=====================================================
