//=====================================================
/*Задача 1
Перепишите код, заменив оператор `if` на тернарный оператор `?`

var result;
if (a + b < 4) {
result = true;
} else {
result = false;
}
*/
//=====================================================
var a = 1, b = 1;
var result = (a + b < 4) ? result = true : result = false;
console.log('1) a+b=' + (a+b) + ', result:' + result);
//=========================================================
a = 1; b = 3;
var result = (a + b < 4) ? result = true : result = false;
console.log('2) a+b=' + (a+b) + ', result:' + result);
//=========================================================
