//=====================================================
/*
Задача 7
Написать код который посчитает сумму всех четных элементов в массиве.
var arr = [1,2,3,4];
**Внимание**!- Не разрашается использовать специальные методы массивов.
*/
//=====================================================
var arr = [1, 2, 3, 4];
var sum = (i = 0);
for (var i = 0; i < arr.length; i++) {
  if (arr[i] % 2 == 0) {
    sum = sum + arr[i];
  }
}
console.log("sum_arr:" + sum); //sum_arr:6
//=====================================================
